workstation/openfoam-master-tutorials/tutorials/incompressible/pisoFoam/RAS/cavity/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

restore0Dir

runApplication topoSet

runApplication $(getApplication)

#------------------------------------------------------------------------------
